haproxy.txt
running (3m00.7s), 0000/7500 VUs, 1328146 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 0000/7500 VUs  3m0s  7500 iters/s  

     ✗ is status 200
      ↳  99% — ✓ 1327895 / ✗ 251
     ✗ record is saved
      ↳  99% — ✓ 1327895 / ✗ 251

     checks.........................: 99.98%  ✓ 2655790     ✗ 502
     data_received..................: 530 MB  2.9 MB/s
     data_sent......................: 321 MB  1.8 MB/s
     dropped_iterations.............: 21859   120.945621/s
     http_req_blocked...............: avg=11.77ms  min=0s     med=0s     max=3.24s  p(90)=0s       p(95)=0s
     http_req_connecting............: avg=11.72ms  min=0s     med=0s     max=3.17s  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=85.53ms  min=1.95ms med=5.02ms max=10.09s p(90)=197ms    p(95)=452.99ms
       { expected_response:true }...: avg=83.64ms  min=1.95ms med=5.02ms max=9.63s  p(90)=196.08ms p(95)=451.46ms
     http_req_failed................: 0.01%   ✓ 251         ✗ 1327895
     http_req_receiving.............: avg=394.4µs  min=0s     med=0s     max=1.35s  p(90)=0s       p(95)=997.5µs
     http_req_sending...............: avg=729.97µs min=0s     med=0s     max=2.26s  p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s     p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=84.4ms   min=1.95ms med=5ms    max=10.08s p(90)=191ms    p(95)=442ms
     http_reqs......................: 1328146 7348.618113/s
     iteration_duration.............: avg=99.09ms  min=1.95ms med=5.97ms max=13.2s  p(90)=214.99ms p(95)=466.95ms
     iterations.....................: 1328146 7348.618113/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500

running (3m00.0s), 0000/7500 VUs, 1318313 complete and 0 interrupted iterations
constant_request_rate ✓ [===============================] 0000/7500 VUs  3m0s  7500 iters/s

     ✗ is status 200
      ↳  99% — ✓ 1317961 / ✗ 352
     ✗ record is saved
      ↳  99% — ✓ 1317961 / ✗ 352

     checks.........................: 99.97%  ✓ 2635922     ✗ 704
     data_received..................: 526 MB  2.9 MB/s
     data_sent......................: 319 MB  1.8 MB/s
     dropped_iterations.............: 31689   176.03716/s
     http_req_blocked...............: avg=5.73ms   min=0s     med=0s     max=2.76s  p(90)=0s       p(95)=0s
     http_req_connecting............: avg=5.58ms   min=0s     med=0s     max=2.71s  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=119.37ms min=1.94ms med=5.96ms max=10.04s p(90)=368.76ms p(95)=744.89ms
       { expected_response:true }...: avg=116.73ms min=1.94ms med=5.96ms max=9.74s  p(90)=367.18ms p(95)=743.23ms
     http_req_failed................: 0.02%   ✓ 352         ✗ 1317961
     http_req_receiving.............: avg=1.38ms   min=0s     med=0s     max=1.67s  p(90)=0s       p(95)=999.4µs
     http_req_sending...............: avg=803.19µs min=0s     med=0s     max=1.89s  p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s     p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=117.19ms min=1.87ms med=5.06ms max=10.03s p(90)=361.59ms p(95)=715.99ms
     http_reqs......................: 1318313 7323.426944/s
     iteration_duration.............: avg=129.14ms min=1.94ms med=5.99ms max=12.73s p(90)=389.11ms p(95)=780.59ms
     iterations.....................: 1318313 7323.426944/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500

running (3m00.0s), 0000/7500 VUs, 1335219 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 0000/7500 VUs  3m0s  7500 iters/s  

     ✗ is status 200
      ↳  99% — ✓ 1333256 / ✗ 1963
     ✗ record is saved
      ↳  99% — ✓ 1333256 / ✗ 1963

     checks.........................: 99.85%  ✓ 2666512     ✗ 3926
     data_received..................: 532 MB  3.0 MB/s
     data_sent......................: 323 MB  1.8 MB/s
     dropped_iterations.............: 14783   82.121985/s
     http_req_blocked...............: avg=6.04ms   min=0s     med=0s     max=2.4s   p(90)=0s       p(95)=0s
     http_req_connecting............: avg=6ms      min=0s     med=0s     max=2.39s  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=91.78ms  min=1.95ms med=5.99ms max=10.34s p(90)=172ms    p(95)=402.99ms
       { expected_response:true }...: avg=77.16ms  min=1.95ms med=5.99ms max=10s    p(90)=165.99ms p(95)=393.45ms
     http_req_failed................: 0.14%   ✓ 1963        ✗ 1333256
     http_req_receiving.............: avg=381.23µs min=0s     med=0s     max=1.32s  p(90)=0s       p(95)=996.9µs
     http_req_sending...............: avg=613.68µs min=0s     med=0s     max=1.28s  p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s     p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=90.78ms  min=1.95ms med=5.99ms max=10.3s  p(90)=167ms    p(95)=392.28ms
     http_reqs......................: 1335219 7417.360113/s
     iteration_duration.............: avg=98.81ms  min=1.95ms med=6ms    max=12.58s p(90)=181.39ms p(95)=417.29ms
     iterations.....................: 1335219 7417.360113/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500

running (3m00.0s), 0000/7500 VUs, 1328743 complete and 0 interrupted iterations
constant_request_rate ✓ [===============================] 0000/7500 VUs  3m0s  7500 iters/s

     ✗ is status 200
      ↳  99% — ✓ 1327125 / ✗ 1618
     ✗ record is saved
      ↳  99% — ✓ 1327125 / ✗ 1618

     checks.........................: 99.87%  ✓ 2654250     ✗ 3236
     data_received..................: 530 MB  2.9 MB/s
     data_sent......................: 321 MB  1.8 MB/s
     dropped_iterations.............: 21268   118.147096/s
     http_req_blocked...............: avg=7.24ms   min=0s     med=0s     max=2.66s  p(90)=0s       p(95)=0s
     http_req_connecting............: avg=7.11ms   min=0s     med=0s     max=2.66s  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=114.13ms min=1.95ms med=5.99ms max=11.82s p(90)=263ms    p(95)=522.99ms
       { expected_response:true }...: avg=102.03ms min=1.95ms med=5.99ms max=9.35s  p(90)=259ms    p(95)=514.99ms
     http_req_failed................: 0.12%   ✓ 1618        ✗ 1327125
     http_req_receiving.............: avg=233.91µs min=0s     med=0s     max=1.45s  p(90)=0s       p(95)=975.4µs
     http_req_sending...............: avg=753.43µs min=0s     med=0s     max=1.8s   p(90)=0s       p(95)=0s
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s     p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=113.14ms min=1.89ms med=5.99ms max=10.38s p(90)=259ms    p(95)=511.64ms
     http_reqs......................: 1328743 7381.377041/s
     iteration_duration.............: avg=123.6ms  min=1.96ms med=6ms    max=12.7s  p(90)=276.38ms p(95)=543.75ms
     iterations.....................: 1328743 7381.377041/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500
---wifi
running (3m00.0s), 0000/7500 VUs, 1218699 complete and 0 interrupted iterations
constant_request_rate ✓ [===============================] 0000/7500 VUs  3m0s  7500 iters/s

     ✗ is status 200
      ↳  99% — ✓ 1214418 / ✗ 4281
     ✗ record is saved
      ↳  99% — ✓ 1214418 / ✗ 4281

     checks.........................: 99.64%  ✓ 2428836     ✗ 8562
     data_received..................: 485 MB  2.7 MB/s
     data_sent......................: 295 MB  1.6 MB/s
     dropped_iterations.............: 131291  729.31136/s
     http_req_blocked...............: avg=17.85ms  min=0s     med=0s      max=4.62s    p(90)=0s    p(95)=0s
     http_req_connecting............: avg=17.55ms  min=0s     med=0s      max=4.52s    p(90)=0s    p(95)=0s
     http_req_duration..............: avg=279.18ms min=3.01ms med=16.99ms max=10.53s   p(90)=1.05s p(95)=1.21s
       { expected_response:true }...: avg=244.26ms min=3.01ms med=16.99ms max=10.11s   p(90)=1.04s p(95)=1.2s
     http_req_failed................: 0.35%   ✓ 4281        ✗ 1214418
     http_req_receiving.............: avg=2.29ms   min=0s     med=0s      max=554.44ms p(90)=0s    p(95)=1ms
     http_req_sending...............: avg=2.07ms   min=0s     med=0s      max=3.29s    p(90)=0s    p(95)=999.9µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s       p(90)=0s    p(95)=0s
     http_req_waiting...............: avg=274.8ms  min=2.98ms med=16.99ms max=10.53s   p(90)=1.03s p(95)=1.19s
     http_reqs......................: 1218699 6769.778776/s
     iteration_duration.............: avg=309.09ms min=3.51ms med=17ms    max=15.26s   p(90)=1.1s  p(95)=1.27s
     iterations.....................: 1218699 6769.778776/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500

running (3m00.1s), 0000/7500 VUs, 1243934 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 0000/7500 VUs  3m0s  7500 iters/s  

     ✗ is status 200
      ↳  99% — ✓ 1242749 / ✗ 1185
     ✗ record is saved
      ↳  99% — ✓ 1242749 / ✗ 1185

     checks.........................: 99.90%  ✓ 2485498     ✗ 2370
     data_received..................: 496 MB  2.8 MB/s
     data_sent......................: 301 MB  1.7 MB/s
     dropped_iterations.............: 106076  588.886291/s
     http_req_blocked...............: avg=12.95ms  min=0s     med=0s      max=3.27s    p(90)=0s    p(95)=0s
     http_req_connecting............: avg=12.76ms  min=0s     med=0s      max=3.13s    p(90)=0s    p(95)=0s
     http_req_duration..............: avg=230.2ms  min=3.77ms med=14.01ms max=11.07s   p(90)=1.04s p(95)=1.21s
       { expected_response:true }...: avg=219.99ms min=3.77ms med=14ms    max=10.89s   p(90)=1.04s p(95)=1.21s
     http_req_failed................: 0.09%   ✓ 1185        ✗ 1242749
     http_req_receiving.............: avg=2.05ms   min=0s     med=0s      max=365.71ms p(90)=0s    p(95)=1ms
     http_req_sending...............: avg=1.74ms   min=0s     med=0s      max=2.04s    p(90)=0s    p(95)=999.6µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s       p(90)=0s    p(95)=0s
     http_req_waiting...............: avg=226.4ms  min=3.51ms med=14ms    max=11.03s   p(90)=1.01s p(95)=1.2s
     http_reqs......................: 1243934 6905.762662/s
     iteration_duration.............: avg=251.47ms min=3.84ms med=14.99ms max=14.15s   p(90)=1.08s p(95)=1.26s
     iterations.....................: 1243934 6905.762662/s
     vus............................: 7500    min=7500      max=7500
     vus_max........................: 7500    min=7500      max=7500